examples/FreeMHD/fringingBField/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     |                                                 |
|   \\  /    A nd           | Copyright (C) 2016 Ehsan Madadi-Kandjani        |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// General macros to create cylinder mesh











// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

// Inner square side half


// Inner square side curvature


// cylinder radius









 // L/Ha















// second cylinder radius




// Base z


// Outlet z


// Length of cylinder


// Number of cells at inner square

// Number of cells between inner square and circle


// Number of cells in the cylinder height










// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //




// 45 degree points angle





// Half of 45 degree points angle

























// Inner square x and y position

// x





// y





// Circle x and y positions

// x





// y






// Second Circle x and y positions

// x





// y





// Inner square x and y position middle curvatures

// x





// y





// Circle x and y positions middle curvatures

// x





// y






// Second Circle x and y positions middle curvatures

// x





// y





// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices
(
    (0.02713 -0.02713 -0.9718) // Vertex s0b = 0 
    (-0.02713 -0.02713 -0.9718) // Vertex s1b = 1 
    (-0.02713 0.02713 -0.9718) // Vertex s2b = 2 
    (0.02713 0.02713 -0.9718) // Vertex s3b = 3 
    
    (0.0343583184978544 -0.0343583184978543 -0.9718) // Vertex r0b = 4 
    (-0.0343583184978543 -0.0343583184978544 -0.9718) // Vertex r1b = 5 
    (-0.0343583184978543 0.0343583184978544 -0.9718) // Vertex r2b = 6 
    (0.0343583184978544 0.0343583184978543 -0.9718) // Vertex r3b = 7 
    
    (0.02713 -0.02713 0.9718) // Vertex s0t = 8 
    (-0.02713 -0.02713 0.9718) // Vertex s1t = 9 
    (-0.02713 0.02713 0.9718) // Vertex s2t = 10 
    (0.02713 0.02713 0.9718) // Vertex s3t = 11 
    
    (0.0343583184978544 -0.0343583184978543 0.9718) // Vertex r0t = 12 
    (-0.0343583184978543 -0.0343583184978544 0.9718) // Vertex r1t = 13 
    (-0.0343583184978543 0.0343583184978544 0.9718) // Vertex r2t = 14 
    (0.0343583184978544 0.0343583184978543 0.9718) // Vertex r3t = 15 

    (0.0404111525448112 -0.0404111525448112 -0.9718) // Vertex w0b = 16 
    (-0.0404111525448112 -0.0404111525448112 -0.9718) // Vertex w1b = 17 
    (-0.0404111525448112 0.0404111525448112 -0.9718) // Vertex w2b = 18 
    (0.0404111525448112 0.0404111525448112 -0.9718) // Vertex w3b = 19 

    (0.0404111525448112 -0.0404111525448112 0.9718) // Vertex w0t = 20 
    (-0.0404111525448112 -0.0404111525448112 0.9718) // Vertex w1t = 21 
    (-0.0404111525448112 0.0404111525448112 0.9718) // Vertex w2t = 22 
    (0.0404111525448112 0.0404111525448112 0.9718) // Vertex w3t = 23 


);

blocks
(
    //block0
    hex (1 0 3 2 9 8 11 10)
    liquid
    (52 52 194)
    simpleGrading (1 1 ((0.05 0.1 10)(0.95 0.9 1)) )
    
    //block1
    hex (0 4 7 3 8 12 15 11)
    liquid
    (52 52 194)
    simpleGrading (((0.0159982123522837 15.9982123522837 1)(0.00538284328318132 27 0.0078944364535032)(7.8944364535032e-05 10 1)) 1 ((0.05 0.1 10)(0.95 0.9 1)) )
    
    //block2
    hex (3 7 6 2 11 15 14 10)
    liquid
    (52 52 194)
    simpleGrading (((0.0159982123522837 15.9982123522837 1)(0.00538284328318132 27 0.0078944364535032)(7.8944364535032e-05 10 1)) 1 ((0.05 0.1 10)(0.95 0.9 1)) )
    
    //block3
    hex (2 6 5 1 10 14 13 9)
    liquid
    (52 52 194)
    simpleGrading (((0.0159982123522837 15.9982123522837 1)(0.00538284328318132 27 0.0078944364535032)(7.8944364535032e-05 10 1)) 1 ((0.05 0.1 10)(0.95 0.9 1)) )
    
    //block4
    hex (1 5 4 0 9 13 12 8)
    liquid
    (52 52 194)
    simpleGrading (((0.0159982123522837 15.9982123522837 1)(0.00538284328318132 27 0.0078944364535032)(7.8944364535032e-05 10 1)) 1 ((0.05 0.1 10)(0.95 0.9 1)) )

    //block5
    hex (4 16 19 7 12 20 23 15)
    solidWalls
    (194 52 194)
    simpleGrading (1 1 ((0.05 0.1 10)(0.95 0.9 1)) )

    //block6
    hex (5 17 16 4 13 21 20 12)
    solidWalls
    (194 52 194)
    simpleGrading (1 1 ((0.05 0.1 10)(0.95 0.9 1)) )

    //block7
    hex (6 18 17 5 14 22 21 13)
    solidWalls
    (194 52 194)
    simpleGrading (1 1 ((0.05 0.1 10)(0.95 0.9 1)) )

    //block8
    hex (7 19 18 6 15 23 22 14)
    solidWalls
    (194 52 194)
    simpleGrading (1 1 ((0.05 0.1 10)(0.95 0.9 1)) )


);

edges
(
    //Circle edges
    arc 7 4 (0.04859 0 -0.9718)
    arc 4 5 (2.9752793985285e-18 -0.04859 -0.9718)
    arc 5 6 (-0.04859 5.95055879705697e-18 -0.9718)
    arc 6 7 (2.9752793985285e-18 0.04859 -0.9718)
    
    //Circle edges
    arc 15 12 (0.04859 0 0.9718)
    arc 12 13 (2.9752793985285e-18 -0.04859 0.9718)
    arc 13 14 (-0.04859 5.95055879705697e-18 0.9718)
    arc 14 15 (2.9752793985285e-18 0.04859 0.9718)
    
    arc 3 0 (0.03049 0 -0.9718)
    arc 0 1 (0 -0.03049 -0.9718)
    arc 1 2 (-0.03049 0 -0.9718)
    arc 2 3 (0 0.03049 -0.9718)
    
    arc 11 8 (0.03049 0 0.9718)
    arc 8 9 (0 -0.03049 0.9718)
    arc 9 10 (-0.03049 0 0.9718)
    arc 10 11 (0 0.03049 0.9718)
    

    //Second Circle edges
    arc 19 16 (0.05715 0 -0.9718)
    arc 16 17 (3.49942822856356e-18 -0.05715 -0.9718)
    arc 17 18 (-0.05715 6.99885645712711e-18 -0.9718)
    arc 18 19 (3.49942822856356e-18 0.05715 -0.9718)
    
    arc 23 20 (0.05715 0 0.9718)
    arc 20 21 (3.49942822856356e-18 -0.05715 0.9718)
    arc 21 22 (-0.05715 6.99885645712711e-18 0.9718)
    arc 22 23 (3.49942822856356e-18 0.05715 0.9718)



);


boundary
(
    exteriorWalls
    {
    type patch;
    faces
    (
        (16 19 23 20)
        (17 16 20 21)
        (18 17 21 22)
        (19 18 22 23)
        (7 19 6 18)
        (6 18 5 17)
        (5 17 4 16)
        (4 16 7 19)
        (15 22 14 23)
        (14 21 13 22)
        (13 20 12 21)
        (12 23 15 20)
    );
    }

    inlet
    {
    type patch;
    faces 
    (
        (3 0 1 2)
        (3 7 4 0)
        (2 6 7 3)
        (1 5 6 2)
        (0 4 5 1)
    );
    }
    
    sink
    {
    type patch;
    faces 
    (
        (11 10 9 8)
        (11 8 12 15)
        (10 11 15 14)
        (9 10 14 13)
        (8 9 13 12)
    );
    }
);

mergePatchPairs
(
);
