examples/FreeMHD/fringingBField/constant/g
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       uniformDimensionedVectorField;
    location    "constant";
    object      g;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -2 0 0 0 0];
value           (0 0 0);
//value           (0 0 -9.81);
//value           (6.936717 0 -6.936717); //45 degrees
//value           (0.5134157 0 -9.796555); //3 degrees
//value           (0.8549978 0 -9.77267); //5 degrees
//value           (1.195538 0 -9.736877); //5 degrees



// ************************************************************************* //
