examples/FreeMHD/fringingBField/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            patch;
        value           uniform ( 0.04 0 0 );
    }
    sink
    {
        type            patch;
        value           uniform ( 0.04 0 0 );
    }
    liquid_to_solidWalls
    {
        type            noSlip;
        value           uniform ( 0 0 0 );
    }
    topOpening
    {
        type            pressureInletOutletVelocity;
        value           uniform ( 0 0 0 );
    }
    exteriorWalls
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    insulatorWalls
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    solidWalls_to_liquid
    {
        type            calculated;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
