examples/FreeMHD/fringingBField/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform  1E+5;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    sink
    {
        type            calculated;
        value           uniform 0;
    }
    liquid_to_solidWalls
    {
        type            calculated;
        value           uniform 0;
    }
    exteriorWalls
    {
        type            calculated;
        value           uniform 100000;
    }
    insulatorWalls
    {
        type            calculated;
        value           uniform 100000;
    }
    solidWalls_to_liquid
    {
        type            calculated;
        value           uniform 0;
    }



}
// ************************************************************************* //
