examples/FreeMHD/fringingBField/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform  1E+5;

boundaryField
{
    inlet
    {
        type            patch;
        value           uniform 100000;
    }
    sink
    {
        type            patch;
        value           uniform 100000;
    }
    liquid_to_solidWalls
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    exteriorWalls
    {
        type            calculated;
        value           uniform 100000;
    }
    insulatorWalls
    {
        type            calculated;
        value           uniform 100000;
    }
    solidWalls_to_liquid
    {
        type            calculated;
        value           uniform 0;
    }


}

// ************************************************************************* //
