examples/FreeMHD/fringingBField/0.orig/B0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      B0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -2 0 0 -1 0];


internalField   uniform (0.666 0 0);

boundaryField
{
    inlet
    {
        type            patch;
        value           uniform ( 0 0.1 0 );
    }
    sink
    {
        type            patch;
        value           uniform ( 0 0.1 0 );
    }
    liquid_to_solidWalls
    {
        type            zeroGradient;
        value           uniform ( 0 0.1 0 );
    }
    exteriorWalls
    {
        type            zeroGradient;
        value           uniform ( 0 0.1 0 );
    }
    insulatorWalls
    {
        type            zeroGradient;
        value           uniform ( 0 0.1 0 );
    }
    solidWalls_to_liquid
    {
        type            zeroGradient;
        value           uniform ( 0 0.1 0 );
    }


}
// ************************************************************************* //
