examples/FreeMHD/fringingBField/0.orig/JxB
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      JxB;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -2 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            patch;
        value           uniform (0 0 0);
    }
    sink
    {
        type            patch;
        value           uniform (0 0 0);
    }
    liquid_to_solidWalls
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    exteriorWalls
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    insulatorWalls
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    solidWalls_to_liquid
    {
        type            calculated;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
