examples/FreeMHD/fringingBField/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;
boundaryField
{
    inlet
    {
        type            patch;
        value           uniform 300;
    }
    sink
    {
        type            patch;
        value           uniform 300;
    }
    liquid_to_solidWalls
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           $internalField;
        Tnbr            T;
        kappaMethod     fluidThermo;
    }
    topOpening
    {
        type            inletOutlet;
        inletValue      uniform 300;
    }
    exteriorWalls
    {
        type            fixedValue;
        value           uniform 300;
    }
    insulatorWalls
    {
        type            fixedValue;
        value           uniform 300;
    }
    solidWalls_to_liquid
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           uniform 300;
        Tnbr            T;
        kappaMethod     solidThermo;
    }
}




// ************************************************************************* //
