examples/FreeMHD/fringingBField/0.orig/liquid/potE
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0/liquid";
    object      potE;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -3 0 0 -1 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            patch;
        name            outletUxB;
        value           uniform 0;
    }
    sink
    {
        type            patch;
        name            outletUxB;
        value           uniform 0;
    }
    liquid_to_solidWalls
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
