examples/FreeMHD/fringingBField/0.orig/potE
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      potE;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -3 0 0 -1 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            patch;
        value           uniform 0;
        name            outletUxB;
    }
    sink
    {
        type            patch;
        value           uniform 0;
        name            outletUxB;
    }
    liquid_to_solidWalls
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           $internalField;
        Tnbr            potE;
        kappaMethod     lookup;
        kappa           elcond;
        kappaName       elcond;
    }
    exteriorWalls
    {
        type            zeroGradient;
        value           uniform 0;
    }
    insulatorWalls
    {
        type            zeroGradient;
        value           uniform 0;
    }
    walls
    {
        type            zeroGradient;
    }
    topOpening
    {
        type            zeroGradient;
    }
    solidWalls_to_liquid
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           $internalField;
        Tnbr            potE;
        kappaMethod     lookup;
        kappa           elcond;
        kappaName       elcond;
    }
}
// ************************************************************************* //
