examples/FreeMHD/fringingBField/system/liquid/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/liquid";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         cellLimited leastSquares 1.0 ;
}

divSchemes
{
	default  Gauss linear;

    div(rhoPhi,U)       Gauss limitedLinear 1.0; 
    div(phi,alpha)      Gauss vanLeer;
    div(phirb,alpha)    Gauss interfaceCompression;

    div(rhoPhi,T)       Gauss limitedLinear 1.0; 
    div(rhoPhi,K)       Gauss limitedLinear 1.0; 
    div(phi,p)          Gauss upwind; 
    div(phi,rho)        Gauss limitedLinear 1.0; 
    
    div(phi,thermo:rho.liquidMetal)          Gauss limitedLinear 1.0; 
    div(phi,thermo:rho.air)          		 Gauss limitedLinear 1.0; 


    div(phi,k)          Gauss upwind; 
    div(phi,omega)      Gauss upwind;
    div(phi,epsilon)    Gauss upwind;
    div(rhoPhi,k)       Gauss upwind;
    div(rhoPhi,omega)   Gauss upwind;
    div(rhoPhi,epsilon) Gauss upwind;

    div(((rho*nuEff)*dev2(T(grad(U)))))     Gauss linear;

}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method meshWave;
}

// ************************************************************************* //
