examples/FreeMHD/fringingBField/system/liquid/setExprFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setExprFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


expressions
(
    B0
     {

        field       B0;
        dimensions  [1 0 -2 0 0 -1 0];
        variables
        (   
		"zPosition = mag(pos().z())/0.0486" 
		"d=0.99"
		"x1=10.78"
		"x0=13.337"
		"x2=15.412"
		"a1=0.6930"
		"a0=-0.1237"
		"a2=-0.5197"
        "B0_Max=0.21"
	);
        
        expression
        #{
        (zPosition < x2) ? 
		((zPosition > x1) ? 
                  vector(0,B0_Max*(d/2+a0*(zPosition-x0)),0): 
                   vector(0, B0_Max*(d+a0/a1*(tanh(a1*(zPosition-x1))+1)), 0)): 
		 vector(0, B0_Max*(a0/a2*(tanh(a2*(zPosition-x2))+1)), 0)
        #};
    }
    
);

// ************************************************************************* //
