examples/FreeMHD/fringingBField/system/solidWalls/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/solidWalls";
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


T
{
    internalField   uniform 300;

    boundaryField
    {
        exteriorWalls
        {
            type            fixedValue;
            value           uniform 300;
        }
		
        
        "solidWalls_to_.*"
        {
            type            compressible::turbulentTemperatureCoupledBaffleMixed;
            Tnbr            T;
            kappaMethod     solidThermo;
            value           uniform 300;
        }
        solidWalls_to_insulator
        {
            type            compressible::turbulentTemperatureCoupledBaffleMixed;
            Tnbr            T;
            kappaMethod     solidThermo;
            value           uniform 300;
        }
    }
}

B0
{
internalField   uniform (0 0.066 0);
    boundaryField
    {
        ".*"
        {
            type            zeroGradient;
            value           uniform (0 0.066 0);
        }
        solidWalls_to_insulator
        {
            type            zeroGradient;
            value           uniform (0 0.066 0);
        }
        solidWalls_to_liquid
        {
            type            zeroGradient;
            value           uniform (0 0.066 0);
        }
    }
}

potE
{
    internalField   uniform 0;

    boundaryField
    {
         exteriorWalls
        {
			type zeroGradient;
			value			uniform 0;
        }
       
        "solidWalls_to_.*"
        {
            type            compressible::turbulentTemperatureCoupledBaffleMixed;
            Tnbr            potE;
            kappaMethod     lookup;
            kappa       	elcond;
			kappaName      	elcond;
            value           $internalField;
            
        }
        solidWalls_to_insulator
        {
            type            compressible::turbulentTemperatureCoupledBaffleMixed;
            Tnbr            potE;
            kappaMethod     lookup;
            kappa       	elcond;
			kappaName      	elcond;
            value           $internalField;
            
        }

    }
}
// ************************************************************************* //
