examples/FreeMHD/fringingBField/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


Lx 0.01;

actions
(

  {
    name    inletFace;
    type    faceSet;
    action  new;
    source  patchToFace;
    sourceInfo
    {
      patch inlet;
    }
  }
  {
        name    inletZone;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
    {
	faceSet inletFace;
    }
  }


    {
        name    liquidCellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (0 -1 -1) (2 1 1);
    }
    {
        name    liquid;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     liquidCellSet;
    }



    { 
        name    corner1Set; // bottom right
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (0 -1.01 -1.01) ($Lx -1 -1);
    }
    {
        name    corner2Set; // top right
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (0 -1.01 1) ($Lx -1 1.01);
    }
    {
        name    corner3Set; // top left
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (0 1 1) ($Lx 1.01 1.01);
    }
    {
        name    corner4Set; // bottom left
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (0 1 -1.01) ($Lx 1.01 -1);
    }
    {
        name    sideWall1Set; // bottom wall
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (0 -1 -1.01) ($Lx 1 -1);
    }
    {
        name    sideWall2Set; // top wall
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (0 -1 1) ($Lx 1 1.01);
    }

    { 
        name    HaWall1Set; // Ha wall
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (0 -1.01 -1) ($Lx -1 1);
    }
    {
        name    HaWall2Set; // ha wall
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (0 1 -1) ($Lx 1.01 1);
    }





    {
        name    solidWalls;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     HaWall1Set;
    }
    {
        name    solidWalls;
        type    cellZoneSet;
        action  add;
        source  setToCellZone;
        set     HaWall2Set;
    }





    {
        name    insulator;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     corner1Set;
    }
    {
        name    insulator;
        type    cellZoneSet;
        action  add;
        source  setToCellZone;
        set     corner2Set;
    }
    {
        name    insulator;
        type    cellZoneSet;
        action  add;
        source  setToCellZone;
        set     corner3Set;
    }
    {
        name    insulator;
        type    cellZoneSet;
        action  add;
        source  setToCellZone;
        set     corner4Set;
    }
    {
        name    insulator;
        type    cellZoneSet;
        action  add;
        source  setToCellZone;
        set     sideWall1Set;
    }
    {
        name    insulator;
        type    cellZoneSet;
        action  add;
        source  setToCellZone;
        set     sideWall2Set;
    }



	// walls face zone
    {   
        name    wallsFace;
        type    faceSet;
        action  new;
        source  cellToFace;
	option 	all;
        set     liquidCellSet;

    }

    {
	name 	inletFace;
	type	faceSet;
	action	new;
	source	patchToFace;
	patch	inlet;
    }
    {   
        name    wallsFace;
        type    faceSet;
        action  subtract;
        source  faceToFace;
	set	inletFace;
    }
    {
	name 	outletFace;
	type	faceSet;
	action	new;
	source	patchToFace;
	patch	sink;
    }
    {   
        name    wallsFace;
        type    faceSet;
        action  subtract;
        source  faceToFace;
	set 	outletFace;
    }
    {
	name	walls;
	type	faceZoneSet;
	action	new;
	source	setToFaceZone;
	faceSet	wallsFace;
    }

);






// ************************************************************************* //
